name: "ensemble_model"
platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "EMBEDDING"
    data_type: TYPE_FP32
    dims: [1024]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "tokenizer_model"
      model_version: -1
      input_map {
        key: "TEXT"
        value: "TEXT"
      }
      output_map {
        key: "INPUT_IDS"
        value: "tokenizer_INPUT_IDS"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "tokenizer_ATTENTION_MASK"
      }
    },
    {
      model_name: "embedding_model"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "tokenizer_INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "tokenizer_ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDING"
        value: "EMBEDDING"
      }
    }
  ]
}