name: "embedding_model"
backend: "onnxruntime"

max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

output [
  {
    name: "sentence_embedding"
    data_type: TYPE_FP32
    dims: [1024]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]